(ns flashcards.dicts.arabic-08
  (:require [flashcards.db :as DB]))

(def dict
  {:name :8th-grade-arabic-cms
   :source "http://cms.education.gov.il/EducationCMS/Units/Tochniyot_Limudim/LashonAravit/MaagareyMilim/lefiAlefBetAravi/Milim8.htm"
   :from-language :arabic
   :to-language :hebrew
   :answer-type :translation
   ::DB/num-buckets 5
   :words {
           "أَخَذَ"
           "לקח"

           "يَأْخُذُ"
           "יקח"

           "أَخِير"
           "אחרון"

           "أَرَادَ"
           "רצה"

           "يُرِيدُ"
           "ירצה"

           "أرْض"
           "אדמה, ארץ"

           "أَراضِي"
           "אדמות, ארצות"

           "أَراضٍ"
           "אדמות, ארצות"

           "أَرْكَان ٱلإسْلام"
           "עמודי האסלאם, מצוות היסוד של האסלאם"

           "أَرِيحَا"
           "יריחו"

           "أُسْبُوع"
           "שבוע"

           "أسَابِيع"
           "שבועות"

           "ألإِسْلاَم"
           "אסלאם"

           "أَلْجَلِيل"
           "הגליל"

           "أَلْحَجّ"
           "העלייה לרגל"

           "أَلْحَمْدُ  لِلّه"
           "השבח לאל, תודה לאל"

           "أَلزَّكَاة"
           "הצדקה"

           "أَلشَّهَادَة"
           "אמירת העדוּת"

           "أَلصَّلاَة"
           "התפילה"

           "أَلصَّوْم"
           "הצום"

           "أَلْعِرَاق"
           "עיראק"

           "ألْقَادِم "
           "הבא"

           "أًلْقَاهِرَة"
           "קהיר"

           "ألْكَعْبَة"
           "הכעבה (במכה)\u200F"

           "ألْكُوَيْت"
           "כווית"

           "ألله"
           "אללה"

           "أَلْمَاضِي"
           "שעבר"

           "ألْمَمْلَكة ٱلْعَرَبِيّة ٱلسُّعُودِيّة"
           "ערב הסעודית"

           "أَلْيَابَان "
           "יפן"

           "أَمَرَ"
           "ציווה"

           "يَأْمُرُ"
           "יצווה"

           "أمْسِ الأَوَّل"
           "שלשום"

           "أَمِير"
           "נסיך"

           "أمِيركا"
           "אמריקה"

           "إِنْسَان"
           "בן-אדם, איש"

           "ناس"
           "בני אדם, אנשים"

           "أُورُوبّا"
           "אירופה"

           "أُولَى"
           "ראשונה"

           "أَيّ"
           "איזה"

           "إِيرَان"
           "איראן"

           "أَيْضًا"
           "גם כן"

           "بارِيس"
           "פריס"

           "بَحْر"
           "ים"

           "بِحار"
           "ימים"

           "بُحُور"
           "ימים"

           "بَدَأَ"
           "התחיל"

           "يَبْدَأُ"
           "יתחיל"

           "بَرِيطَانيا"
           "בריטניה"

           "بُسْتَان"
           "גן"

           "بَسَاتِين"
           "גנים"

           "بَصَل"
           "בצל"

           "بَعْدَ الظُّهْر"
           "אחר הצהרים"

           "بَعِيد عَنْ"
           "רחוק מ-\u200F"

           "بَغْداد"
           "בגדאד"

           "بَلَدِيّة"
           "עירייה"

           "بَنَى"
           "בנה"

           "يَبْنِي"
           "יבנה"

           "تَحْتَ"
           "תחת, מתחת ל-\u200F"

           "تَرَكَ"
           "עזב, השאיר"

           "يَتْرُكُ"
           "יעזוב, ישאיר"

           "تَعْبَان"
           "עייף"

           "تِلِفِزْيُون"
           "טלוויזיה"

           "تِلِفِزْيُونات"
           "טלוויזיות"

           "تِلِفُون"
           "טלפון"

           "تِلِفُونات"
           "טלפונים"

           "تِلْكَ"
           "ההיא"

           "ثُمَّ"
           "אחר כך"

           "جَار"
           "שָׁכֵן"

           "جِيرَان"
           "שכנים"

           "جَدّ"
           "סב"

           "أجْدَاد"
           "סבים"

           "جَدَّة"
           "סבתא"

           "جَدَّات"
           "סבתות"

           "جِدًّا"
           "מאד"

           "جُمْلة"
           "משפט"

           "جُمَل"
           "משפטים"

           "جَنُوب"
           "דרום"

           "جَوَاب"
           "תשובה"

           "أَجْوِبَة"
           "תשובות"

           "حَاسُوب"
           "מחשב"

           "حَواسِيب"
           "מחשבים"

           "حَدِيث"
           "חדיש, מודרני"

           "حَفْلَة"
           "מסיבה, חגיגה"

           "حَفَلات"
           "מסיבות, חגיגות"

           "حِكَايَة"
           "סיפור"

           "حِكَايَات"
           "סיפורים"

           "حُكُومَة"
           "ממשלה"

           "حُكُومَات"
           "ממשלות"

           "خَال"
           "דוד (מצד האם)\u200F"

           "أخْوَال"
           "דודים (מצד האם)\u200F"

           "خَرَجَ"
           "יָצא"

           "يَخْرُجُ"
           "יֶצא"

           "خِلاَلَ "
           "במשך, תוך (זמן)\u200F"

           "دَخَلَ"
           "נכנס"

           "يَدْخُلُ"
           "יכנס"

           "دَرْس"
           "שיעור"

           "دُرُوس"
           "שיעורים"

           "دَوْلَة"
           "מדינה"

           "دُوَل"
           "מדינות"

           "دِين"
           "דת"

           "أَدْيَان"
           "דתות"

           "ذٰلِكَ"
           "ההוא"

           "رَئِيس"
           "נשיא, ראש"

           "رُؤَسَاء"
           "נשיאים, ראשים"

           "رَئِيس الحُكُومَة"
           "ראש הממשלה"

           "رِسَالَة"
           "איגרת, מכתב"

           "رَسَائِل"
           "איגרות, מכתבים"

           "رَمَضَان"
           "רמצ'אן"

           "زَرَعَ"
           "זרע"

           "يَزْرَعُ"
           "יזרע"

           "زَمَان"
           "זמן"

           "سُؤَال"
           "שאלה"

           "أَسْئِلَة"
           "שאלות"

           "سَافَرَ"
           "נסע"

           "سَمِعَ"
           "שמע"

           "يَسْمَعُ"
           "ישמע"

           "سُوق"
           "שוק"

           "أَسْوَاق"
           "שווקים"

           "شَارِع"
           "רחוב"

           "شَوَارِع"
           "רחובות"

           "شُبَّاك"
           "חלון"

           "شَبَابِيك"
           "חלונות"

           "شَرْق"
           "מזרח"

           "شُكْرًا  عَلَى –"
           "תודה על-\u200F"

           "عَفْوًا"
           "בבקשה"

           "شَمَال"
           "צפון, שמאל"

           "صَيْف"
           "קיץ"

           "ضَحِكَ"
           "צחק"

           "يَضْحَكُ"
           "יצחק"

           "طَاوِلَة"
           "שולחן"

           "طَاوِلَات"
           "שלחנות"

           "طَبِيب"
           "רופא"

           "أَطِبّاء"
           "רופאים"

           "طَرِيق"
           "דרך, כביש"

           "طُرُق"
           "דרכים, כבישים"

           "طَلَبَ"
           "ביקש"

           "يَطْلُبُ"
           "יבקש"

           "طَوِيل"
           "ארוך, גבוה"

           "طَيِّب"
           "טוב"

           "عائِلَة"
           "משפחה"

           "عائِلَات"
           "משפחות"

           "عَرَفَ"
           "יָדע, הכיר"

           "يَعْرِفُ"
           "יֶדע, יכיר"

           "عَسَل"
           "דבש"

           "عُطْلَة"
           "חופשה"

           "عُطْلَات"
           "חופשות"

           "عَكَّا"
           "עכו"

           "عَمّ"
           "דוד (מצד האב)\u200F"

           "أَعْمَام"
           "דודים (מצד האב)\u200F"

           "عَمَل"
           "עבודה"

           "أَعْمَال"
           "עבודות"

           "عَنْ"
           "על, על אודות"

           "عِنْدَمَا"
           "כאשר"

           "عُنْوَان"
           "כתובת, כותרת"

           "عَنَاوِين"
           "כתובות, כותרות"

           "عِيد"
           "חג"

           "أعْيَاد"
           "חגים"

           "عِيد ٱلأَضْحَى"
           "חג הקרבן (באסלאם)\u200F"

           "عِيد ٱلفِطْر"
           "חג הפסקת הצום (באסלאם)\u200F"

           "عِيد مِيلاد"
           "יום הולדת"

           "غَدًا"
           "מחר"

           "فَرَنْسَا"
           "צרפת"

           "فَلاّح (ج) فَلاّحُونَ"
           "איכר"

           "فُنْدُق"
           "בית מלון, פונדק"

           "فَنادِق"
           "בתי מלון, פונדקים"

           "فَهِمَ"
           "הבין"

           "يَفْهَمُ"
           "יבין"

           "فِيلم"
           "סרט"

           "أَفْلام"
           "סרטים"

           "قَامَ"
           "קם"

           "يَقُومُ"
           "יקום"

           "قَامَ بِ"
           "עסק ב-, ערך (ביקור)\u200F"

           "يَقُومُ بِ"
           "יעסוק ב-, יערוך (ביקור)\u200F"

           "قَدْ"
           "כבר (מילית להדגשת העבר)\u200F"

           "قَدِمَ"
           "בא"

           "يَقْدَمُ"
           "יבוא"

           "قَدِيم"
           "ישן, עתיק, קדום"

           "قَرْيَة"
           "כפר"

           "قُرَى"
           "כפרים"

           "قُرًى"
           "כפרים"

           "قِصَّة"
           "סיפור"

           "قِصَص"
           "סיפורים"

           "قَصِير"
           "קצר, נמוך"

           "قَلَم"
           "עט"

           "أَقْلام"
           "עטים"

           "كُرْسِيّ"
           "כיסא"

           "كَرَاسِي"
           "כיסאות"

           "كَرَاسٍ"
           "כיסאות"

           "كَلام"
           "דיבור, דברים"

           "لَنْدَن"
           "לונדון"

           "مَبْرُوك عَلَى - أَلله يبارِك فِيك"
           "מזל טוב, תתחדש"

           "مَبْرُوك عَلَى - أَلله يبارِك بِك"
           "מזל טוב, תתחדשי"

           "مَتَى"
           "מתי?\u200F"

           "مَرْكَز"
           "מרכז"

           "مَرَاكِز"
           "מרכזים"

           "مَرْكَزِيّ"
           "מרכזי"

           "مَرِيض"
           "חולה"

           "مَرْضَى"
           "חולים"

           "مَسَاء"
           "ערב"

           "مَسَاء الخَيْر"
           "ערב טוב"

           "مَسَاء النُّور"
           "ערב טוב"

           "مَسْجِد"
           "מסגד"

           "مَسَاجِد"
           "מסגדים"

           "مُسْلِم"
           "מוסלמי"

           "مُسْلِمُونَ"
           "מוסלמים"

           "مَسِيحِيّ"
           "נוצרי"

           "مَسِيحِيُّونَ"
           "נוצרים"

           "مِصْر"
           "מצרים"

           "مَكَان"
           "מקום"

           "أَمَاكِن"
           "מקומות"

           "مَكْتَبَة"
           "ספרייה, מכתבה"

           "مَكْتَبَات"
           "ספריות, מכתבות"

           "مُمْتَاز"
           "מצוין"

           "نَبِيّ"
           "נביא"

           "أَنْبِيَاء"
           "נביאים"

           "هٰؤُلاءِ"
           "אלה, האלה"

           "وَالِد"
           "אב, הורה"

           "وَالِدَة"
           "אם"

           "وَراءَ"
           "מאחורי (מקום)\u200F"

           "وَظِيفَة"
           "מטלה (שיעורי-בית)\u200F"

           "وَقَفَ"
           "עמד"

           "يَقِفُ"
           "יעמוד"

           "يَمِين"
           "ימין"

           "يَوْم ٱلأَحَد"
           "יום ראשון"

           "يَوْم ٱلجُمْعَة"
           "יום שישי"

           "يَوْم ٱلْخَمِيس"
           "יום חמישי"

           "يَوْم ٱلسَّبْت"
           "יום שבת"
           }})
